node {
  name: "Placeholder"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 75
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 75
        }
      }
    }
  }
}
node {
  name: "Placeholder_1"
  op: "Placeholder"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 75
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 75
        }
      }
    }
  }
}
node {
  name: "fifo_queue"
  op: "FIFOQueueV2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 512
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
          dim {
            size: 75
          }
        }
        shape {
          dim {
            size: 75
          }
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fifo_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "fifo_queue"
  input: "Placeholder"
  input: "Placeholder_1"
  device: "/device:CPU:0"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_INT64
        type: DT_INT64
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "fifo_queue_Close"
  op: "QueueCloseV2"
  input: "fifo_queue"
  device: "/device:CPU:0"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1330
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1330
          }
        }
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c1s1_007401_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c1s1_007451_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c2s1_006551_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c3s1_006551_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c3s1_006851_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c4s1_007701_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c4s1_007801_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c4s1_009076_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c5s1_007326_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c5s1_007501_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c5s1_007526_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0056_c5s1_007626_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0064_c2s1_008301_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0064_c2s1_008326_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0064_c2s1_008351_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0064_c3s1_008526_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0064_c3s1_008551_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0064_c6s1_009101_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0064_c6s1_009126_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0064_c6s1_009151_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0064_c6s1_009176_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0070_c1s1_010951_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0070_c3s1_010501_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0070_c4s1_010576_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0070_c4s1_010601_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0070_c5s1_011076_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0122_c1s1_019951_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0122_c1s1_020001_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0122_c4s1_020126_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0122_c4s1_020151_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0125_c1s1_021101_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0125_c2s1_020701_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0125_c4s1_020676_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0125_c4s1_020726_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0169_c1s1_030551_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0169_c2s1_029851_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0169_c2s1_029876_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c1s1_033026_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c1s1_033051_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c1s1_037051_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c1s1_037101_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c2s1_032476_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c2s1_032501_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c2s1_032526_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c3s1_032601_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c3s1_036426_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c3s1_036501_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c5s1_033051_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c5s1_037051_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c5s1_037076_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c5s1_037126_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c5s1_037151_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c5s1_037176_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c6s1_033151_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c6s1_033176_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c6s1_033201_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c6s1_036851_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c6s1_036876_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c6s1_036926_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c6s1_036951_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c6s1_036976_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0178_c6s1_036976_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0201_c1s1_039976_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0201_c1s1_040001_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0201_c2s1_039376_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0201_c2s1_039401_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0201_c2s1_039501_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0201_c3s1_039676_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0201_c6s1_040226_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0201_c6s1_040251_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0201_c6s1_040276_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c1s1_042176_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c1s1_045276_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c1s1_045426_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c1s1_045426_08.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c1s2_002716_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c1s2_019491_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c1s4_036856_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c1s4_036906_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c1s4_037006_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c2s1_045276_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c2s1_075021_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c2s1_091821_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c2s2_094482_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s1_041751_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s1_041776_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s1_044601_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s1_044726_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s1_044751_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s1_070017_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s1_070042_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s1_074667_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s1_074692_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s1_091967_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s2_097053_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c3s2_097128_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c4s1_041626_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c4s1_041726_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s1_042151_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s1_042176_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s1_042301_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s1_045301_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s1_045326_09.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s1_075373_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s1_075523_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s1_092348_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s2_097627_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s2_097727_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c5s2_097902_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_042276_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_042301_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_042326_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_042351_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_042376_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_042401_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_042426_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_045076_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_045126_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_045176_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_045226_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_045251_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_070576_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_070601_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_070626_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_070651_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_070676_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_075151_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_075176_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_075201_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_075226_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s1_075301_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s2_091243_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s2_091268_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0208_c6s2_091343_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c1s1_051726_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c2s1_051151_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c2s1_051176_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c2s1_051276_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c3s1_050951_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c3s1_050976_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c5s1_051776_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c5s1_051776_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c5s1_051801_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c5s1_051851_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c6s1_051451_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c6s1_051476_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0248_c6s1_051501_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0249_c2s1_051976_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0249_c2s1_052001_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0249_c2s1_052026_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0249_c3s1_051901_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0249_c3s1_051926_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c1s1_053401_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c1s1_053526_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c1s4_032931_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c1s4_032956_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c2s1_052926_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c2s1_052951_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c2s1_053026_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c2s1_053051_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c2s1_053951_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c2s1_054026_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c2s2_090382_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c2s2_090382_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c2s2_090407_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c3s1_052826_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c3s1_054276_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c3s1_054301_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c3s2_093128_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c3s2_093203_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c3s2_093228_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c5s1_052801_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c5s1_053326_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c5s1_053376_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c5s1_053401_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c6s1_054876_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c6s2_087218_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0254_c6s2_087243_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c1s1_055181_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c1s1_055231_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c1s1_055581_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c1s1_060656_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c1s2_009166_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c2s1_060071_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c2s1_060246_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c2s1_081421_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c2s1_081446_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c3s1_054926_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c3s1_055001_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c3s1_055176_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c3s1_059842_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c3s1_059867_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c3s1_081642_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c3s1_081667_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c5s1_055176_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c5s1_055223_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c5s1_055273_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c5s1_055498_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c5s1_060648_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c5s1_060723_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c5s1_060773_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c5s1_082048_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055401_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055476_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055501_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055526_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055526_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055551_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055551_10.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055576_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055601_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055626_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055651_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055676_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055701_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055726_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055726_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055751_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055801_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055801_10.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055876_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055901_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_055926_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_060301_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_060326_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_060376_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_060401_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_082251_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_082301_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0261_c6s1_082326_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c1s1_057306_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c1s1_057331_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c1s1_065656_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c2s1_056746_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c2s1_056746_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c2s1_056771_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c2s1_065146_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c3s1_056892_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c3s1_056942_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c3s1_064892_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c5s1_057248_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c5s1_057348_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c5s1_065623_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c5s1_065698_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c5s1_065698_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c6s1_057476_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c6s1_057501_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c6s1_057526_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c6s1_057551_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c6s1_057576_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c6s1_065376_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c6s1_065401_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c6s1_065426_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c6s1_065451_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0266_c6s1_065476_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c3s1_075617_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c5s1_076273_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c5s1_076373_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_067276_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_067326_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_067351_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_067376_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_067426_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_076026_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_076051_10.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_076101_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_076126_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_076126_08.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_076151_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0301_c6s1_076176_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c1s1_070731_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c1s1_070781_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c2s1_070146_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c2s1_070146_09.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c2s1_070171_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c2s1_070171_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c3s1_070242_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c3s1_070317_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c3s1_070467_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c4s1_071232_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c4s1_071282_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c4s1_071382_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c5s1_070848_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c5s1_071048_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c5s1_071098_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0314_c5s1_071123_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c1s2_003766_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c1s2_003816_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c1s4_054886_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c1s4_054911_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c1s5_051591_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c1s5_051616_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c1s5_051641_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c1s5_051866_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c2s3_019282_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c2s3_019307_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s1_075767_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s1_075817_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s1_078267_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s1_078317_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s2_105528_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s2_105553_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s2_115144_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s2_115169_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s2_115194_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s3_025153_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c3s3_025178_10.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c4s2_003717_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c4s2_003742_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c4s2_003742_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c4s2_005517_08.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c4s2_005542_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c4s4_044685_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c4s4_044710_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c4s4_054766_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c4s5_050760_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c4s5_050810_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c5s1_076473_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c5s1_076523_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c5s1_076673_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c5s1_078673_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c5s1_078698_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c5s2_105927_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c5s2_105977_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c5s2_106002_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c5s2_115899_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c5s2_115924_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s1_076276_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s1_076301_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s1_076351_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s1_076401_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s1_076451_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s1_078801_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s1_078876_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s2_099668_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s2_099718_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s2_099743_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s2_099768_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s2_109218_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s2_109268_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s2_109318_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0333_c6s2_109368_07.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c1s2_005191_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c1s2_005266_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c2s1_077996_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c2s1_078096_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c2s1_078121_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c3s1_077817_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c4s2_004467_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c4s2_004592_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c4s2_004817_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c5s1_078273_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0339_c5s1_078298_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c1s2_008416_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c2s1_080671_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c2s1_080671_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c2s1_080696_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c2s1_080696_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c3s1_080867_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c3s1_080942_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c5s1_081198_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c5s1_081223_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c5s1_081273_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c6s1_081476_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c6s1_081501_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c6s1_081526_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0348_c6s1_081551_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c1s2_015241_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c1s2_015316_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c1s2_015341_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c1s2_022816_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c1s2_022941_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c2s1_087496_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c2s1_087521_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c3s1_087642_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c3s1_087667_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c3s1_095042_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c3s1_095092_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c5s1_088148_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c5s1_095698_08.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c5s1_095723_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c5s1_095748_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0370_c5s1_095773_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c1s2_016641_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c2s1_088921_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c2s1_088946_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c2s1_096846_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c2s1_096871_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c3s1_089092_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c3s1_089117_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c3s1_096617_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c5s1_089448_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c5s1_089498_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c5s1_097423_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c5s1_097473_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c5s1_097473_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0377_c5s1_097548_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0398_c1s2_022116_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0398_c1s2_027466_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0398_c3s1_094467_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0398_c3s1_094567_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0398_c3s1_099717_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0398_c3s1_099742_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0398_c5s1_094873_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0398_c5s1_095098_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c1s2_060121_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c2s1_097821_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c2s1_097821_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c2s1_097846_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c2s1_097846_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c2s1_097871_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c2s1_098046_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c2s1_098096_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c2s1_132366_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c2s1_132366_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c3s1_098292_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c3s1_098317_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c3s1_132083_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c3s1_132108_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c3s1_132158_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c3s1_132183_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c5s1_098348_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c5s1_098398_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c5s1_098598_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0413_c5s1_098623_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0459_c1s6_032496_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0459_c1s6_032546_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0459_c1s6_032596_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0459_c4s6_031516_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0459_c4s6_031541_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0459_c4s6_031741_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0459_c4s6_031791_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0459_c4s6_031841_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c1s2_067146_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c1s4_021206_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c1s4_021281_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c2s1_139366_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c2s1_139491_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c2s2_078882_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c2s2_078907_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c3s1_139608_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c3s1_139658_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c3s1_139708_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c3s2_081428_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c3s2_081453_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c3s2_081628_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c5s1_139870_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c5s1_140020_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c5s2_082302_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c5s2_082352_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c5s2_082352_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c6s2_075318_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c6s2_075418_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c6s2_075443_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c6s2_075568_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c6s2_075618_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0508_c6s2_075643_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0522_c1s2_071346_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0522_c3s1_143733_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0522_c4s2_070848_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0522_c4s2_070873_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0522_c4s2_070898_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0522_c4s2_070948_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0522_c5s1_144145_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0537_c1s3_005196_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0537_c1s3_005221_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0537_c2s1_152491_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0537_c4s3_004798_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0537_c4s3_004823_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0537_c5s1_152920_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0537_c5s1_152945_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0539_c1s3_007796_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0539_c1s3_007821_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0539_c1s3_007846_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0539_c2s1_154666_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0539_c2s1_154691_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0539_c2s1_154791_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0539_c4s3_007873_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0539_c4s3_007973_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0539_c5s1_155495_07.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0539_c5s1_155520_07.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0546_c1s3_010146_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0546_c2s1_157316_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0546_c2s1_157341_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0546_c2s1_157416_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0546_c3s1_157358_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0546_c3s1_157533_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0546_c3s1_157608_05.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0546_c3s1_157633_08.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0552_c1s3_010496_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0552_c1s3_010521_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0552_c2s1_157766_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0552_c2s1_157766_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0552_c2s1_157791_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0552_c3s1_157958_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0552_c3s1_157983_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0552_c3s1_158008_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0552_c5s1_158345_06.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c1s3_011946_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c1s3_011971_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c1s3_027901_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c1s3_027951_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c3s1_159233_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c3s1_159258_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c3s2_013287_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c3s2_013337_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c3s2_013362_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c5s1_159695_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c5s1_159720_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c5s1_159770_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c5s2_013980_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c5s2_014030_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c5s2_014080_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c6s2_007393_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c6s2_007418_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c6s2_007443_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c6s2_007468_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c6s2_007518_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c6s2_007518_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c6s2_007593_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c6s2_007618_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0555_c6s2_007618_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0556_c1s3_011321_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0556_c1s3_011371_03.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0556_c1s3_013996_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0556_c1s3_014071_04.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0556_c3s1_158683_02.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0556_c3s1_161008_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0556_c3s1_161133_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0556_c3s1_161158_01.jpg"
        string_val: "./Market-1501-v15.09.15/bounding_box_train/0556_c3s1_161158_05.jpg"
